app/Controllers/AuthController.php

    public function login()
    {
        if ($this->request->getPost()) {
            $rules = [
                'username' => 'required|min_length[5]',
                'password' => 'required|min_length[5]',
            ];

            if ($this->validate($rules)) {
                $username = $this->request->getVar('username');
                $password = $this->request->getVar('password');

                $dataUser = $this->user->where(['username' => $username])->first(); //pasw 1234567

                if ($dataUser) {
                    if (password_verify($password, $dataUser['password'])) {
                        session()->set([
                            'username' => $dataUser['username'],
                            'role' => $dataUser['role'],
                            'isLoggedIn' => TRUE
                        ]);

                        $diskonModel = new \App\Models\DiskonModel();
                        $today = date('Y-m-d');
                        $diskon = $diskonModel->where('tanggal', $today)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'egiindra'
 LIMIT 1
SELECT *
FROM `diskon`
WHERE `tanggal` = '2025-07-04'
 LIMIT 1