app/Controllers/DiskonController.php

    public function index()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/')->with('error', 'Akses hanya untuk admin');
        }
        $model = new DiskonModel();
        $data['diskon'] = $model->findAll();
---
SELECT *
FROM `diskon`