app/Controllers/Home.php

SELECT *
FROM `product`
SELECT *
FROM `diskon`
WHERE `tanggal` = '2025-07-04'
 LIMIT 1
---
        public function index()
        {
            $product = $this->product->findAll();
            $diskonModel = new \App\Models\DiskonModel();
            $today = date('Y-m-d');
            $diskon = $diskonModel->where('tanggal', $today)->first();

SELECT *
FROM `transaction`
WHERE `username` = 'lintang'
SELECT `transaction_detail`.*, `product`.`nama`, `product`.`harga`, `product`.`foto`
FROM `transaction_detail`
JOIN `product` ON `transaction_detail`.`product_id`=`product`.`id`
WHERE `transaction_id` = '17'
---
        public function profile()
{
    $username = session()->get('username');
    $data['username'] = $username;

    $buy = $this->transaction->where('username', $username)->findAll();
    $data['buy'] = $buy;

    $product = [];

    if (!empty($buy)) {
        foreach ($buy as $item) {
            $detail = $this->transaction_detail->select('transaction_detail.*, product.nama, product.harga, product.foto')->join('product', 'transaction_detail.product_id=product.id')->where('transaction_id', $item['id'])->findAll();