app/Controllers/TransaksiController.php

    public function getTransaksiDataArray()
    {
        // Menggunakan properti yang sudah ada dari constructor, lebih efisien.
        $transaksi = $this->transaction->findAll();

        foreach ($transaksi as &$t) {
            // Hitung jumlah item untuk transaksi ini
            $jumlahItem = $this->transaction_detail->where('transaction_id', $t['id'])->selectSum('jumlah')->first();
            $t['jumlah_item'] = $jumlahItem['jumlah'] ?? 0;
            // Hitung total diskon untuk transaksi ini
            $totalDiskon = $this->transaction_detail->where('transaction_id', $t['id'])->selectSum('diskon')->first();
---
SELECT *
FROM `transaction`
SELECT SUM(`jumlah`) AS `jumlah`
FROM `transaction_detail`
WHERE `transaction_id` = '1'
 LIMIT 1
SELECT SUM(`diskon`) AS `diskon`
FROM `transaction_detail`
WHERE `transaction_id` = '1'
 LIMIT 1

    public function cart_add()
    {
        $diskonModel = new \App\Models\DiskonModel();
        $today = date('Y-m-d');
        $diskonRow = $diskonModel->where('tanggal', $today)->first();
---
SELECT *
FROM `diskon`
WHERE `tanggal` = '2025-07-04'
 LIMIT 1